export const REGIONS = {
  "강원특별자치도": {
    "전체": [],
    "강릉시": ["전체", "강동면", "구정면", "금학동", "교동", "내곡동", "노암동", "담산동", "대신동", "두산동", "명주동", "병산동", "사천면", "성남동", "성산면", "송정동", "신석동", "안현동", "옥계면", "옥천동", "왕산면", "용강동", "운정동", "유산동", "입암동", "장현동", "저동", "주문진읍", "죽헌동", "중앙동", "청량동", "초당동", "포남동", "학동", "홍제동", "회산동"],
    "고성군": ["전체", "간성읍", "거진읍", "수동면", "죽왕면", "토성면", "현내면"],
    "동해시": ["전체", "발한동", "북삼동", "북평동", "삼화동", "송정동", "천곡동", "추암동", "평릉동", "효가동"],
    "삼척시": ["전체", "갈천동", "건지동", "교동", "근덕면", "남양동", "당저동", "도계읍", "등봉동", "마달동", "맹방동", "미로면", "사직동", "성남동", "성북동", "오분동", "원덕읍", "읍상동", "읍중동", "정상동", "정하동", "정라동", "조비동", "증산동", "지정동", "하장면", "호산동"],
    "속초시": ["전체", "교동", "금호동", "대포동", "도문동", "동명동", "설악동", "영랑동", "장사동", "조양동", "청학동", "청호동", "노학동"],
    "양구군": ["전체", "국토정중앙면", "남면", "동면", "방산면", "해안면", "양구읍"],
    "양양군": ["전체", "강현면", "서면", "손양면", "현남면", "현북면", "양양읍"],
    "영월군": ["전체", "김삿갓면", "남면", "무릉도원면", "북면", "상동읍", "수주면", "영월읍", "중동면", "한반도면"],
    "원주시": ["전체", "가현동", "개운동", "관설동", "단계동", "단구동", "명륜동", "무실동", "반곡관설동", "봉산동", "부론면", "소초면", "신림면", "우산동", "원동", "일산동", "지정면", "중앙동", "태장동", "판부면", "행구동", "흥업면"],
    "인제군": ["전체", "기린면", "남면", "북면", "상남면", "서화면", "인제읍"],
    "정선군": ["전체", "고한읍", "남면", "북면", "사북읍", "신동읍", "여량면", "임계면", "정선읍", "화암면"],
    "철원군": ["전체", "갈말읍", "근남면", "김화읍", "동송읍", "서면", "철원읍"],
    "춘천시": ["전체", "교동", "근화동", "낙원동", "남면", "남산면", "동면", "동내면", "동산면", "북산면", "사농동", "사북면", "서면", "석사동", "신동", "신북읍", "약사명동", "온의동", "요선동", "우두동", "운교동", "조양동", "중앙동", "퇴계동", "효자동", "후평동"],
    "태백시": ["전체", "구문소동", "문곡소도동", "상장동", "장성동", "철암동", "황지동"],
    "평창군": ["전체", "대관령면", "대화면", "미탄면", "방림면", "봉평면", "용평면", "진부면", "평창읍"],
    "화천군": ["전체", "간동면", "사내면", "상서면", "하남면", "화천읍"],
    "횡성군": ["전체", "갑천면", "강림면", "공근면", "둔내면", "서원면", "안흥면", "우천면", "청일면", "횡성읍"]
  },
  "경기도": {
    "전체": [],
    "가평군": ["전체", "가평읍", "북면", "상면", "설악면", "조종면", "청평면", "하면"],
    "고양시": ["전체", "덕양구", "일산동구", "일산서구"],
    "과천시": ["전체", "갈현동", "과천동", "관문동", "막계동", "문원동", "별양동", "부림동", "원문동", "주암동", "중앙동"],
    "광명시": ["전체", "광명동", "노온사동", "소하동", "옥길동", "일직동", "철산동", "하안동"],
    "광주시": ["전체", "경안동", "곤지암읍", "남한산성면", "도척면", "목동", "송정동", "실촌읍", "오포읍", "역동", "중앙동", "초월읍", "퇴촌면"],
    "구리시": ["전체", "갈매동", "교문동", "동구동", "사노동", "수택동", "아천동", "인창동", "토평동"],
    "군포시": ["전체", "광정동", "궁내동", "금정동", "당동", "당정동", "대야미동", "도마교동", "둔대동", "부곡동", "산본동", "속달동", "오금동"],
    "김포시": ["전체", "고촌읍", "구래동", "대곶면", "마산동", "양촌읍", "운양동", "월곶면", "장기동", "통진읍", "하성면", "풍무동", "김포동", "사우동"],
    "남양주시": ["전체", "가운동", "금곡동", "다산동", "도농동", "별내동", "별내면", "수동면", "오남읍", "와부읍", "이패동", "일패동", "조안면", "지금동", "진건읍", "진접읍", "퇴계원면", "평내동", "호평동", "화도읍"],
    "동두천시": ["전체", "광암동", "동두천동", "보산동", "상봉암동", "상패동", "생연동", "송내동", "안흥동", "지행동", "탑동동", "하봉암동"],
    "성남시": ["전체", "분당구", "수정구", "중원구"],
    "수원시": ["전체", "권선구", "영통구", "장안구", "팔달구"],
    "시흥시": ["전체", "계수동", "과림동", "광석동", "군자동", "금이동", "논곡동", "능곡동", "대야동", "도창동", "목감동", "무지내동", "매화동", "미산동", "방산동", "산현동", "신천동", "안현동", "월곶동", "은행동", "장곡동", "장현동", "정왕동", "조남동", "죽율동", "포동", "하상동", "하중동", "화정동"],
    "안산시": ["전체", "단원구", "상록구"],
    "안성시": ["전체", "가사동", "가현동", "개산동", "고삼면", "공도읍", "구포동", "금광면", "금산동", "금석동", "낙원동", "당왕동", "대덕면", "대천동", "도기동", "동본동", "명륜동", "미양면", "봉남동", "봉산동", "사곡동", "삼죽면", "서인동", "서운면", "석정동", "성남동", "숭인동", "신모산동", "신소현동", "신흥동", "양성면", "연지동", "영동", "옥천동", "원곡면", "인지동", "일죽면", "죽산면", "중리동", "창전동", "현수동", "계동", "보개면"],
    "안양시": ["전체", "동안구", "만안구"],
    "양주시": ["전체", "고읍동", "광사동", "광적면", "남면", "덕계동", "덕정동", "마전동", "백석읍", "봉양동", "산북동", "삼숭동", "어둔동", "은현면", "율정동", "유양동", "장흥면", "회암동", "회정동"],
    "양평군": ["전체", "강상면", "강하면", "개군면", "단월면", "서종면", "양동면", "양서면", "양평읍", "옥천면", "용문면", "지평면", "청운면"],
    "여주시": ["전체", "가남읍", "강천면", "교동", "능서면", "대신면", "매룡동", "북내면", "산북면", "삼교동", "상거동", "연라동", "오금동", "오학동", "점동면", "점봉동", "창동", "천송동", "하거동", "현암동", "홍문동", "흥천면", "여흥동"],
    "연천군": ["전체", "군남면", "미산면", "백학면", "신서면", "왕징면", "전곡읍", "장남면", "중면", "청산면", "연천읍"],
    "오산시": ["전체", "가장동", "갈곶동", "고현동", "궐동", "금암동", "누읍동", "서동", "세교동", "수청동", "양산동", "원동", "은계동", "지곶동", "청학동", "탑동"],
    "용인시": ["전체", "기흥구", "수지구", "처인구"],
    "의왕시": ["전체", "고천동", "내손동", "오전동", "왕곡동", "월암동", "이동", "청계동", "포일동", "학의동"],
    "의정부시": ["전체", "가능동", "고산동", "금오동", "낙양동", "녹양동", "민락동", "산곡동", "신곡동", "용현동", "의정부동", "장암동", "자일동", "호원동"],
    "이천시": ["전체", "관고동", "마장면", "모가면", "백사면", "부발읍", "사음동", "설성면", "신둔면", "안흥동", "율면", "장록동", "장호원읍", "중리동", "증포동", "창전동", "호법면"],
    "파주시": ["전체", "광탄면", "교하읍", "군내면", "금촌동", "문산읍", "법원읍", "월롱면", "적성면", "조리읍", "진동면", "진서면", "탄현면", "파주읍", "파평면"],
    "평택시": ["전체", "고덕면", "군문동", "도일동", "동삭동", "모곡동", "비전동", "서정동", "세교동", "송탄동", "신대동", "신장동", "안중읍", "오성면", "용이동", "원평동", "이충동", "장당동", "죽백동", "지산동", "진위면", "청룡동", "청북읍", "칠원동", "팽성읍", "평택동", "포승읍", "합정동", "현덕면"],
    "포천시": ["전체", "가산면", "관인면", "군내면", "내촌면", "동교동", "선단동", "소흘읍", "신북면", "영북면", "영중면", "일동면", "창수면", "화현면", "포천동"],
    "하남시": ["전체", "감북동", "감일동", "감천동", "교산동", "덕풍동", "망월동", "미사동", "배알미동", "상사창동", "상산곡동", "선동", "신장동", "창우동", "천현동", "초이동", "춘궁동", "풍산동", "하사창동", "하산곡동", "학암동", "항동"],
    "화성시": ["전체", "남양읍", "동탄면", "마도면", "매송면", "봉담읍", "비봉면", "서신면", "송산면", "양감면", "우정읍", "장안면", "정남면", "팔탄면", "향남읍"]
  },
  "광주광역시": {
    "전체": [],
    "광산구": ["전체", "고룡동", "광산동", "남산동", "내산동", "대산동", "덕림동", "도덕동", "도림동", "도산동", "동림동", "동호동", "등임동", "명도동", "명화동", "박호동", "본덕동", "본량동", "북산동", "비아동", "사호동", "산막동", "산수동", "산월동", "삼거동", "삼도동", "서봉동", "선암동", "소촌동", "송대동", "송정동", "수완동", "신가동", "신동", "신룡동", "신창동", "신촌동", "쌍암동", "안청동", "양동", "연산동", "오선동", "오운동", "왕동", "용곡동", "용동", "용봉동", "우산동", "운남동", "운수동", "월계동", "월곡동", "월전동", "유계동", "임곡동", "장덕동", "장수동", "지산동", "지야동", "진곡동", "청계동", "평동", "하남동", "흑석동"],
    "남구": ["전체", "구동", "노대동", "대촌동", "덕남동", "도금동", "방림동", "백운동", "봉선동", "사동", "사직동", "송암동", "송하동", "승촌동", "양림동", "양촌동", "압촌동", "월산동", "원산동", "이장동", "임암동", "주월동", "지석동", "진월동", "칠석동", "행암동", "화장동", "회산동"],
    "동구": ["전체", "계림동", "금남로", "금동", "남동", "내남동", "대인동", "대의동", "동명동", "불로동", "산수동", "서석동", "선교동", "소태동", "수기동", "용산동", "운림동", "월남동", "장동", "지산동", "충장로", "학동", "호남동", "황금동"],
    "북구": ["전체", "각화동", "금곡동", "누문동", "대촌동", "덕의동", "동림동", "두암동", "망월동", "매곡동", "문흥동", "본촌동", "북동", "삼각동", "생용동", "석곡동", "수곡동", "신안동", "신용동", "양산동", "연제동", "오룡동", "오치동", "용강동", "용두동", "용봉동", "용전동", "우산동", "운암동", "월출동", "유동", "일곡동", "임동", "장등동", "중흥동", "지야동", "청풍동", "충효동", "태령동", "풍향동", "화암동", "효령동"],
    "서구": ["전체", "금호동", "내방동", "농성동", "덕흥동", "마륵동", "매월동", "벽진동", "상무동", "세하동", "송하동", "양동", "유촌동", "치평동", "풍암동", "화정동"]
  },
  "대구광역시": {
    "전체": [],
    "남구": ["전체", "대명동", "봉덕동", "이천동"],
    "달서구": ["전체", "갈산동", "감삼동", "대곡동", "대천동", "도원동", "두류동", "본리동", "상인동", "성당동", "송현동", "신당동", "월성동", "이곡동", "장기동", "죽전동", "진천동", "파호동", "호림동"],
    "달성군": ["전체", "가창면", "구지면", "논공읍", "다사읍", "옥포읍", "유가읍", "하빈면", "현풍읍", "화원읍"],
    "동구": ["전체", "각산동", "검사동", "내곡동", "능성동", "대림동", "덕곡동", "도동", "도평동", "동호동", "둔산동", "매여동", "미곡동", "미대동", "방촌동", "봉무동", "불로동", "상매동", "서호동", "송정동", "숙천동", "신서동", "신암동", "신천동", "신평동", "신기동", "율암동", "율하동", "입석동", "지묘동", "지저동", "진인동", "평광동", "효목동", "해안동"],
    "북구": ["전체", "검단동", "고성동", "관음동", "구암동", "국우동", "금호동", "노곡동", "대현동", "도남동", "동변동", "동천동", "매천동", "복현동", "사수동", "산격동", "서변동", "연경동", "읍내동", "조야동", "칠성동", "침산동", "태전동", "학정동"],
    "서구": ["전체", "내당동", "비산동", "상리동", "원대동", "이현동", "중리동", "평리동"],
    "수성구": ["전체", "가천동", "고모동", "고산동", "만촌동", "매호동", "범물동", "범어동", "사월동", "상동", "성동", "수성동", "시지동", "신매동", "연호동", "욱수동", "이천동", "중동", "지산동", "파동", "황금동"],
    "중구": ["전체", "남산동", "대봉동", "대신동", "동문동", "동성로", "동인동", "봉산동", "삼덕동", "상덕동", "상서동", "성내동", "수동", "시장북로", "완전동", "인교동", "전동", "종로", "태평로", "포정동", "하서동", "향촌동"]
  },
  "대전광역시": {
    "전체": [],
    "대덕구": ["전체", "갈전동", "대화동", "덕암동", "목상동", "문평동", "미호동", "법동", "부수동", "비래동", "삼정동", "상서동", "석봉동", "송촌동", "신대동", "신일동", "신탄진동", "연축동", "오정동", "와동", "읍내동", "이현동", "장동", "중리동", "평촌동", "황호동", "회덕동"],
    "동구": ["전체", "가양동", "낭월동", "내탑동", "대동", "대별동", "마산동", "비룡동", "사성동", "산내동", "삼성동", "상소동", "성남동", "세천동", "소제동", "신상동", "신안동", "신인동", "신하동", "신흥동", "용계동", "용운동", "용전동", "원동", "이현동", "인동", "자양동", "장척동", "정동", "주산동", "중앙동", "천동", "추동", "판암동", "하소동", "홍도동", "효동"],
    "서구": ["전체", "가수원동", "가장동", "갈마동", "관저동", "괴곡동", "괴정동", "기성동", "내동", "도마동", "도안동", "둔산동", "만년동", "매노동", "변동", "복수동", "봉곡동", "산직동", "오동", "용문동", "우명동", "원정동", "장안동", "정림동", "탄방동", "평촌동", "흑석동"],
    "유성구": ["전체", "가정동", "갑동", "계산동", "관평동", "교촌동", "구룡동", "구성동", "구암동", "궁동", "금고동", "금탄동", "노은동", "대동", "대정동", "덕명동", "덕진동", "도룡동", "둔곡동", "문지동", "반석동", "방현동", "봉명동", "봉산동", "상대동", "성북동", "세동", "송강동", "송정동", "신동", "신성동", "신봉동", "신성동", "안산동", "어은동", "외삼동", "용계동", "용산동", "원내동", "원신흥동", "원촌동", "자운동", "장대동", "장동", "전민동", "지족동", "죽동", "탑립동", "하기동", "학하동", "화암동"],
    "중구": ["전체", "대사동", "대흥동", "목동", "문창동", "문화동", "부사동", "사정동", "산성동", "석교동", "오류동", "옥계동", "용두동", "유천동", "은행선화동", "정림동", "중촌동", "태평동", "호동"]
  },
  "부산광역시": {
    "전체": [],
    "강서구": ["전체", "가덕도동", "강동동", "구랑동", "녹산동", "대저동", "명지동", "미음동", "범방동", "봉림동", "생곡동", "성북동", "송정동", "식만동", "신호동", "죽동", "죽림동", "지사동", "천성동", "화전동"],
    "금정구": ["전체", "구서동", "금사동", "금성동", "남산동", "노포동", "두구동", "부곡동", "서동", "선동", "오륜동", "장전동", "청룡동", "회동동"],
    "기장군": ["전체", "기장읍", "일광읍", "장안읍", "정관읍", "철마면"],
    "남구": ["전체", "감만동", "대연동", "문현동", "용당동", "용호동", "우암동"],
    "동구": ["전체", "범일동", "수정동", "좌천동", "초량동"],
    "동래구": ["전체", "낙민동", "명륜동", "명장동", "복천동", "사직동", "수안동", "안락동", "온천동", "칠산동"],
    "부산진구": ["전체", "가야동", "개금동", "당감동", "범전동", "범천동", "부암동", "부전동", "양정동", "연지동", "전포동", "초읍동"],
    "북구": ["전체", "구포동", "금곡동", "덕천동", "만덕동", "화명동"],
    "사상구": ["전체", "감전동", "괘법동", "덕포동", "모라동", "삼락동", "엄궁동", "주례동", "학장동"],
    "사하구": ["전체", "감천동", "괴정동", "다대동", "당리동", "신평동", "장림동", "하단동"],
    "서구": ["전체", "남부민동", "동대신동", "부민동", "서대신동", "아미동", "암남동", "초장동", "충무동"],
    "수영구": ["전체", "광안동", "남천동", "망미동", "민락동", "수영동"],
    "연제구": ["전체", "거제동", "연산동"],
    "영도구": ["전체", "남항동", "대교동", "대평동", "동삼동", "봉래동", "신선동", "영선동", "청학동"],
    "중구": ["전체", "광복동", "남포동", "대청동", "동광동", "보수동", "부평동", "영주동", "중앙동"],
    "해운대구": ["전체", "반송동", "반여동", "석대동", "송정동", "우동", "재송동", "좌동", "중동"]
  },
  "서울특별시": {
    "전체": [],
    "강남구": ["전체", "개포동", "논현동", "대치동", "도곡동", "삼성동", "세곡동", "수서동", "신사동", "압구정동", "역삼동", "율현동", "일원동", "자곡동", "청담동"],
    "강동구": ["전체", "강일동", "고덕동", "길동", "둔촌동", "명일동", "상일동", "성내동", "암사동", "천호동"],
    "강북구": ["전체", "미아동", "번동", "삼각산동", "삼양동", "송중동", "송천동", "수유동", "우이동", "인수동"],
    "강서구": ["전체", "가양동", "개화동", "공항동", "과해동", "등촌동", "마곡동", "방화동", "염창동", "오곡동", "오쇠동", "화곡동"],
    "관악구": ["전체", "남현동", "봉천동", "신림동"],
    "광진구": ["전체", "광장동", "구의동", "군자동", "능동", "자양동", "중곡동", "화양동"],
    "구로구": ["전체", "가리봉동", "개봉동", "고척동", "구로동", "궁동", "신도림동", "오류동", "온수동", "천왕동", "항동"],
    "금천구": ["전체", "가산동", "독산동", "시흥동"],
    "노원구": ["전체", "공릉동", "상계동", "월계동", "중계동", "하계동"],
    "도봉구": ["전체", "도봉동", "방학동", "쌍문동", "창동"],
    "동대문구": ["전체", "답십리동", "신설동", "용두동", "이문동", "장안동", "전농동", "제기동", "청량리동", "회기동", "휘경동"],
    "동작구": ["전체", "노량진동", "대방동", "동작동", "본동", "사당동", "상도동", "신대방동", "흑석동"],
    "마포구": ["전체", "공덕동", "구수동", "노고산동", "당인동", "대흥동", "도화동", "동교동", "마포동", "망원동", "상수동", "상암동", "서교동", "성산동", "신공덕동", "신수동", "신정동", "아현동", "연남동", "염리동", "용강동", "중동", "창전동", "토정동", "하중동", "합정동", "현석동"],
    "서대문구": ["전체", "남가좌동", "냉천동", "대현동", "미근동", "봉원동", "북가좌동", "북아현동", "신촌동", "연희동", "영천동", "옥천동", "창천동", "천연동", "충정로", "합동", "현저동", "홍은동", "홍제동"],
    "서초구": ["전체", "내곡동", "반포동", "방배동", "서초동", "신원동", "양재동", "염곡동", "우면동", "원지동", "잠원동"],
    "성동구": ["전체", "금호동", "도선동", "마장동", "사근동", "상왕십리동", "성수동", "송정동", "옥수동", "용답동", "응봉동", "하왕십리동", "행당동", "홍익동"],
    "성북구": ["전체", "길음동", "돈암동", "동선동", "동소문동", "보문동", "삼선동", "상월곡동", "석관동", "성북동", "안암동", "장위동", "정릉동", "종암동", "하월곡동"],
    "송파구": ["전체", "가락동", "거여동", "마천동", "문정동", "방이동", "삼전동", "석촌동", "송파동", "오금동", "잠실동", "장지동", "풍납동"],
    "양천구": ["전체", "목동", "신월동", "신정동"],
    "영등포구": ["전체", "당산동", "대림동", "도림동", "문래동", "신길동", "양평동", "여의도동", "영등포동"],
    "용산구": ["전체", "갈월동", "남영동", "도원동", "동빙고동", "동자동", "문배동", "보광동", "산천동", "서빙고동", "신계동", "신창동", "이촌동", "이태원동", "주성동", "청파동", "한강로", "한남동", "효창동", "후암동"],
    "은평구": ["전체", "갈현동", "구산동", "녹번동", "대조동", "불광동", "수색동", "신사동", "역촌동", "응암동", "증산동", "진관동"],
    "종로구": ["전체", "가회동", "견지동", "경운동", "계동", "공평동", "관수동", "관철동", "관훈동", "교남동", "교북동", "구기동", "궁정동", "권농동", "낙원동", "내수동", "내자동", "누상동", "누하동", "당주동", "도렴동", "동숭동", "명륜가", "묘동", "무악동", "봉익동", "부암동", "사간동", "사직동", "삼청동", "서린동", "세종로", "소격동", "송월동", "송현동", "수송동", "숭인동", "신교동", "신문로", "신영동", "안국동", "연건동", "연지동", "예지동", "옥인동", "와룡동", "운니동", "원남동", "원서동", "이화동", "익선동", "인사동", "장사동", "재동", "적선동", "종로가", "중학동", "창성동", "창신동", "청운동", "청진동", "체부동", "충신동", "통의동", "통인동", "팔판동", "평동", "평창동", "필운동", "혜화동", "홍지동", "효자동", "효제동", "훈정동"],
    "중구": ["전체", "광희동", "남대문로", "남산동", "남창동", "남학동", "다동", "만리동", "명동", "무교동", "묵정동", "방산동", "봉래동", "북창동", "산림동", "삼각동", "서소문동", "소공동", "수표동", "수하동", "신당동", "쌍림동", "예관동", "예장동", "오장동", "을지로", "의주로", "인현동", "입정동", "장교동", "장충동", "저동", "정동", "주교동", "주자동", "중림동", "초동", "충무로", "충정로", "태평로", "필동", "황학동", "회현동", "흥인동"]
  },
  "세종특별자치시": {
    "전체": [],
    "세종시": ["전체", "고운동", "금남면", "나성동", "다정동", "대평동", "도담동", "반곡동", "보람동", "부강면", "새롬동", "소담동", "소정면", "아름동", "어진동", "연기면", "연동면", "연서면", "전동면", "전의면", "조치원읍", "종촌동", "한솔동", "합강동", "해밀동", "집현동", "가람동", "다솜동", "온빛동", "참샘동"]
  },
  "울산광역시": {
    "전체": [],
    "남구": ["전체", "고사동", "달동", "두왕동", "매암동", "무거동", "삼산동", "선암동", "성암동", "수암동", "신정동", "야음동", "여천동", "옥동", "황성동"],
    "동구": ["전체", "남목동", "대송동", "동부동", "방어동", "서부동", "일산동", "전하동", "화정동"],
    "북구": ["전체", "가대동", "구유동", "달천동", "대안동", "매곡동", "명촌동", "무룡동", "산하동", "상안동", "송정동", "시례동", "신명동", "신천동", "양정동", "연암동", "정자동", "중산동", "진장동", "창평동", "천곡동", "호계동"],
    "울주군": ["전체", "두동면", "두서면", "범서읍", "삼남읍", "삼동면", "상북면", "언양읍", "온산읍", "온양읍", "웅촌면", "청량읍", "서생면"],
    "중구": ["전체", "교동", "남외동", "다운동", "동동", "반구동", "병영동", "복산동", "성남동", "성안동", "약사동", "옥교동", "우정동", "유곡동", "장현동", "태화동", "학산동", "학성동"]
  }
};

// 지역 검색을 위한 유틸리티 함수들
export const getAllRegions = () => {
  const result = [];
  for (const location1 in REGIONS) {
    for (const location2 in REGIONS[location1]) {
      for (const location3 of REGIONS[location1][location2]) {
        result.push({
          location1,
          location2,
          location3,
          fullAddress: `${location1} ${location2} ${location3}`
        });
      }
    }
  }
  return result;
};

export const getLocations1 = () => Object.keys(REGIONS);

export const getLocations2 = (location1) => {
  return location1 && REGIONS[location1] ? Object.keys(REGIONS[location1]) : [];
};

export const getLocations3 = (location1, location2) => {
  return location1 && location2 && REGIONS[location1]?.[location2] ? REGIONS[location1][location2] : [];
};
